"""
Представлен список чисел. Определить элементы списка, не имеющие повторений.
Сформировать итоговый массив чисел, соответствующих требованию.
Элементы вывести в порядке их следования в исходном списке.
Для выполнения задания обязательно использовать генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]
"""
# Немного изменено решение 2-го задания
my_list = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
my_list2 = [100, -50, -25, 150, 236, 100, 69, 150, 78, 99, 69, 1, -350, -25, -5, 1]
new_list = [el for el in my_list if my_list.count(el) == 1]
new_list_2 = [el for el in my_list2 if my_list2.count(el) == 1]
print(f'Первый список {my_list}')
print(f'Первый список после обработки {new_list}')
print(f'Второй список {my_list2}')
print(f'Второй список после обработки {new_list_2}')