"""
Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.

Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.

Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
"""

my_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
my_list2 = [100, -50, -25, 150, 236, 69, 55, 78, 99, 101, 1, -350, -100, -5, 1]
new_list = [my_list[i] for i in range(1, len(my_list)) if my_list[i] > my_list[i - 1]]
new_list_2 = [my_list2[i] for i in range(1, len(my_list2)) if my_list2[i] > my_list2[i - 1]]
print(f'Первый список {my_list}')
print(f'Первый список после обработки {new_list}')
print(f'Второй список {my_list2}')
print(f'Второй список после обработки {new_list_2}')
