"""
Для чисел в пределах от 20 до 240 найти числа, кратные 20 или 21. Необходимо решить задание в одну строку.
Подсказка: использовать функцию range() и генератор.

При обработке чисел кратных 20 пришлось указать верхний предел 241 по 2 причинам:
1. Из-за функции range - фактическое значение вехнего предела = указанное число - 1
2. 240 кратен 20, следовательно 240 нужно включить обязательно
"""
print(f'Кратные 20 {[el for el in range(20, 241, 20)]}, кратные 21 {[el for el in range(21, 240, 21)]}')
